benchmarks/vllm/tm-l40s/Qwen3.6-35B-A3B-PP2/tm-l40sx2_qwen35b_a3b_PP2_in4096_out128_p200_c200_b6f9ec.txt
BENCHMARK: tm-l40sx2_qwen35b_a3b_PP2_in4096_out128_p200_c200_b6f9ec
================================================================
Namespace(subparser='bench', bench_type='serve', dispatch_function=<function BenchmarkServingSubcommand.cmd at 0x75defbdf1300>, trust_remote_code=False, seed=0, num_prompts=200, dataset_name='random', no_stream=False, dataset_path=None, no_oversample=False, skip_chat_template=False, enable_multimodal_chat=False, disable_shuffle=False, custom_output_len=256, spec_bench_output_len=256, spec_bench_category=None, sonnet_input_len=550, sonnet_output_len=150, sonnet_prefix_len=200, sharegpt_output_len=None, blazedit_min_distance=0.0, blazedit_max_distance=1.0, asr_max_audio_len_sec=inf, asr_min_audio_len_sec=0.0, random_input_len=4096, random_output_len=128, random_range_ratio=0.0, random_prefix_len=0, random_batch_size=1, no_reranker=False, random_mm_base_items_per_request=1, random_mm_num_mm_items_range_ratio=0.0, random_mm_limit_mm_per_prompt={'image': 255, 'video': 1}, random_mm_bucket_config={(256, 256, 1): 0.5, (720, 1280, 1): 0.5, (720, 1280, 16): 0.0}, hf_subset=None, hf_split=None, hf_name=None, hf_output_len=None, prefix_repetition_prefix_len=256, prefix_repetition_suffix_len=256, prefix_repetition_num_prefixes=10, prefix_repetition_output_len=128, label=None, backend='vllm', base_url='http://localhost:8000', host='127.0.0.1', port=8000, endpoint='/v1/completions', header=None, max_concurrency=200, model='Qwen/Qwen3.6-35B-A3B', input_len=None, output_len=None, tokenizer=None, tokenizer_mode='auto', use_beam_search=False, logprobs=None, request_rate=inf, burstiness=1.0, disable_tqdm=False, num_warmups=0, profile=False, save_result=True, save_detailed=True, append_result=False, metadata=None, result_dir='./benchmarks/vllm/tm-l40s/Qwen3.6-35B-A3B-PP2', result_filename='tm-l40sx2_qwen35b_a3b_PP2_in4096_out128_p200_c200_b6f9ec.json', ignore_eos=True, percentile_metrics='ttft,tpot,itl,e2el', metric_percentiles='99', goodput=None, request_id_prefix='bench-638d5b33-', top_p=None, top_k=None, min_p=None, temperature=None, frequency_penalty=None, presence_penalty=None, repetition_penalty=None, served_model_name=None, lora_modules=None, lora_assignment='random', ramp_up_strategy=None, ramp_up_start_rps=None, ramp_up_end_rps=None, ready_check_timeout_sec=0, extra_body=None, skip_tokenizer_init=False, insecure=False, plot_timeline=False, timeline_itl_thresholds=[25.0, 50.0], plot_dataset_stats=False)
INFO 04-30 08:26:31 [datasets.py:700] Sampling input_len from [4096, 4096] and output_len from [128, 128]
WARNING: vllm bench serve no longer sets temperature==0 (greedy) in requests by default. The default will be determined on the server side and can be model/API specific. For the old behavior, include --temperature=0.
Starting initial single prompt test run...
Skipping endpoint ready check.
Starting main benchmark run...
Traffic request rate: inf
Burstiness factor: 1.0 (Poisson process)
Maximum request concurrency: 200

  0%|          | 0/200 [00:00<?, ?it/s]
  0%|          | 1/200 [00:23<1:16:24, 23.04s/it]
  1%|          | 2/200 [00:23<32:26,  9.83s/it]  
  2%|▏         | 3/200 [00:24<18:30,  5.64s/it]
  2%|▏         | 4/200 [00:24<11:39,  3.57s/it]
  2%|▎         | 5/200 [00:25<08:00,  2.46s/it]
  3%|▎         | 6/200 [00:25<05:48,  1.80s/it]
  4%|▎         | 7/200 [00:26<04:25,  1.37s/it]
  4%|▍         | 8/200 [00:26<03:30,  1.09s/it]
  4%|▍         | 9/200 [00:27<02:53,  1.10it/s]
  5%|▌         | 10/200 [00:27<02:28,  1.28it/s]
  6%|▌         | 11/200 [00:28<02:11,  1.44it/s]
  6%|▌         | 12/200 [00:28<01:59,  1.57it/s]
  6%|▋         | 13/200 [00:29<01:52,  1.67it/s]
  7%|▋         | 14/200 [00:29<01:45,  1.76it/s]
  8%|▊         | 15/200 [00:30<01:41,  1.83it/s]
  8%|▊         | 16/200 [00:30<01:37,  1.88it/s]
  8%|▊         | 17/200 [00:31<01:35,  1.91it/s]
  9%|▉         | 18/200 [00:31<01:34,  1.92it/s]
 10%|▉         | 19/200 [00:32<01:33,  1.93it/s]
 10%|█         | 20/200 [00:32<01:32,  1.95it/s]
 10%|█         | 21/200 [00:33<01:31,  1.95it/s]
 11%|█         | 22/200 [00:33<01:30,  1.96it/s]
 12%|█▏        | 23/200 [00:34<01:29,  1.98it/s]
 12%|█▏        | 24/200 [00:34<01:28,  1.99it/s]
 12%|█▎        | 25/200 [00:35<01:28,  1.99it/s]
 13%|█▎        | 26/200 [00:35<01:27,  1.98it/s]
 14%|█▎        | 27/200 [00:36<01:26,  2.00it/s]
 14%|█▍        | 28/200 [00:36<01:26,  2.00it/s]
 14%|█▍        | 29/200 [00:37<01:26,  1.99it/s]
 15%|█▌        | 30/200 [00:37<01:25,  1.99it/s]
 16%|█▌        | 31/200 [00:38<01:24,  2.00it/s]
 16%|█▌        | 32/200 [00:38<01:23,  2.01it/s]
 16%|█▋        | 33/200 [00:39<01:23,  2.00it/s]
 17%|█▋        | 34/200 [00:39<01:23,  1.99it/s]
 18%|█▊        | 35/200 [00:40<01:23,  1.99it/s]
 18%|█▊        | 36/200 [00:40<01:22,  2.00it/s]
 18%|█▊        | 37/200 [00:41<01:21,  1.99it/s]
 19%|█▉        | 38/200 [00:41<01:21,  1.99it/s]
 20%|█▉        | 39/200 [00:42<01:21,  1.98it/s]
 20%|██        | 40/200 [00:42<01:21,  1.97it/s]
 20%|██        | 41/200 [00:43<01:20,  1.97it/s]
 21%|██        | 42/200 [00:43<01:19,  1.99it/s]
 22%|██▏       | 43/200 [00:44<01:18,  1.99it/s]
 22%|██▏       | 44/200 [00:44<01:18,  1.98it/s]
 22%|██▎       | 45/200 [00:45<01:17,  1.99it/s]
 23%|██▎       | 46/200 [00:46<01:27,  1.76it/s]
 24%|██▎       | 47/200 [00:46<01:23,  1.83it/s]
 24%|██▍       | 48/200 [00:46<01:20,  1.89it/s]
 24%|██▍       | 49/200 [00:47<01:18,  1.92it/s]
 25%|██▌       | 50/200 [00:47<01:17,  1.94it/s]
 26%|██▌       | 51/200 [00:48<01:15,  1.96it/s]
 26%|██▌       | 52/200 [00:48<01:14,  1.98it/s]
 26%|██▋       | 53/200 [00:49<01:14,  1.98it/s]
 27%|██▋       | 54/200 [00:49<01:13,  1.99it/s]
 28%|██▊       | 55/200 [00:52<02:42,  1.12s/it]
 28%|██▊       | 56/200 [00:53<02:18,  1.04it/s]
 28%|██▊       | 57/200 [00:53<02:04,  1.15it/s]
 29%|██▉       | 58/200 [00:54<01:43,  1.37it/s]
 30%|██▉       | 59/200 [00:54<01:33,  1.50it/s]
 30%|███       | 60/200 [00:55<01:26,  1.62it/s]
 30%|███       | 61/200 [00:55<01:20,  1.72it/s]
 31%|███       | 62/200 [00:56<01:16,  1.79it/s]
 32%|███▏      | 63/200 [00:56<01:13,  1.85it/s]
 32%|███▏      | 64/200 [00:57<01:11,  1.90it/s]
 32%|███▎      | 65/200 [00:57<01:10,  1.93it/s]
 33%|███▎      | 66/200 [00:58<01:09,  1.94it/s]
 34%|███▎      | 67/200 [00:58<01:08,  1.95it/s]
 34%|███▍      | 68/200 [00:59<01:07,  1.96it/s]
 34%|███▍      | 69/200 [00:59<01:06,  1.98it/s]
 35%|███▌      | 70/200 [01:00<01:05,  1.99it/s]
 36%|███▌      | 71/200 [01:00<01:05,  1.97it/s]
 36%|███▌      | 72/200 [01:01<01:05,  1.96it/s]
 36%|███▋      | 73/200 [01:01<01:04,  1.96it/s]
 37%|███▋      | 74/200 [01:02<01:04,  1.96it/s]
 38%|███▊      | 75/200 [01:02<01:03,  1.96it/s]
 38%|███▊      | 76/200 [01:03<01:12,  1.72it/s]
 38%|███▊      | 77/200 [01:04<01:08,  1.80it/s]
 39%|███▉      | 78/200 [01:04<01:06,  1.84it/s]
 40%|███▉      | 79/200 [01:05<01:04,  1.88it/s]
 40%|████      | 80/200 [01:05<01:02,  1.92it/s]
 40%|████      | 81/200 [01:06<01:01,  1.94it/s]
 41%|████      | 82/200 [01:06<01:00,  1.95it/s]
 42%|████▏     | 83/200 [01:07<00:59,  1.95it/s]
 42%|████▏     | 84/200 [01:07<00:58,  1.97it/s]
 42%|████▎     | 85/200 [01:08<00:58,  1.98it/s]
 43%|████▎     | 86/200 [01:08<00:57,  1.97it/s]
 44%|████▎     | 87/200 [01:09<00:57,  1.97it/s]
 44%|████▍     | 88/200 [01:09<00:56,  1.99it/s]
 44%|████▍     | 89/200 [01:10<00:55,  1.99it/s]
 45%|████▌     | 90/200 [01:10<00:55,  1.97it/s]
 46%|████▌     | 91/200 [01:11<00:55,  1.97it/s]
 46%|████▌     | 92/200 [01:11<00:55,  1.96it/s]
 46%|████▋     | 93/200 [01:12<00:54,  1.96it/s]
 47%|████▋     | 94/200 [01:12<00:53,  1.96it/s]
 48%|████▊     | 95/200 [01:13<01:01,  1.72it/s]
 48%|████▊     | 96/200 [01:13<00:58,  1.79it/s]
 48%|████▊     | 97/200 [01:14<00:56,  1.84it/s]
 49%|████▉     | 98/200 [01:14<00:53,  1.89it/s]
 50%|████▉     | 99/200 [01:15<00:52,  1.93it/s]
 50%|█████     | 100/200 [01:15<00:51,  1.95it/s]
 50%|█████     | 101/200 [01:16<00:50,  1.97it/s]
 51%|█████     | 102/200 [01:16<00:49,  1.97it/s]
 52%|█████▏    | 103/200 [01:17<00:49,  1.97it/s]
 52%|█████▏    | 104/200 [01:17<00:48,  1.98it/s]
 52%|█████▎    | 105/200 [01:18<00:47,  1.98it/s]
 53%|█████▎    | 106/200 [01:18<00:47,  1.98it/s]
 54%|█████▎    | 107/200 [01:19<00:46,  1.98it/s]
 54%|█████▍    | 108/200 [01:19<00:46,  2.00it/s]
 55%|█████▍    | 109/200 [01:22<01:35,  1.05s/it]
 55%|█████▌    | 110/200 [01:22<01:21,  1.10it/s]
 56%|█████▌    | 111/200 [01:23<01:14,  1.20it/s]
 56%|█████▌    | 112/200 [01:23<01:02,  1.42it/s]
 56%|█████▋    | 113/200 [01:24<00:56,  1.55it/s]
 57%|█████▋    | 114/200 [01:24<00:51,  1.66it/s]
 57%|█████▊    | 115/200 [01:25<00:48,  1.74it/s]
 58%|█████▊    | 116/200 [01:25<00:46,  1.81it/s]
 58%|█████▊    | 117/200 [01:26<00:44,  1.87it/s]
 59%|█████▉    | 118/200 [01:26<00:42,  1.91it/s]
 60%|█████▉    | 119/200 [01:27<00:41,  1.93it/s]
 60%|██████    | 120/200 [01:27<00:40,  1.95it/s]
 60%|██████    | 121/200 [01:28<00:40,  1.96it/s]
 61%|██████    | 122/200 [01:28<00:39,  1.97it/s]
 62%|██████▏   | 123/200 [01:29<00:38,  1.99it/s]
 62%|██████▏   | 124/200 [01:29<00:38,  1.98it/s]
 62%|██████▎   | 125/200 [01:30<00:38,  1.97it/s]
 63%|██████▎   | 126/200 [01:30<00:37,  1.97it/s]
 64%|██████▎   | 127/200 [01:31<00:37,  1.96it/s]
 64%|██████▍   | 128/200 [01:31<00:36,  1.97it/s]
 64%|██████▍   | 129/200 [01:32<00:35,  1.98it/s]
 65%|██████▌   | 130/200 [01:33<00:40,  1.72it/s]
 66%|██████▌   | 131/200 [01:33<00:38,  1.79it/s]
 66%|██████▌   | 132/200 [01:34<00:37,  1.84it/s]
 66%|██████▋   | 133/200 [01:34<00:35,  1.89it/s]
 67%|██████▋   | 134/200 [01:35<00:34,  1.92it/s]
 68%|██████▊   | 135/200 [01:35<00:33,  1.94it/s]
 68%|██████▊   | 136/200 [01:36<00:32,  1.95it/s]
 68%|██████▊   | 137/200 [01:36<00:32,  1.97it/s]
 69%|██████▉   | 138/200 [01:37<00:31,  1.98it/s]
 70%|██████▉   | 139/200 [01:37<00:30,  1.97it/s]
 70%|███████   | 140/200 [01:38<00:30,  1.97it/s]
 70%|███████   | 141/200 [01:38<00:29,  1.98it/s]
 71%|███████   | 142/200 [01:39<00:29,  1.99it/s]
 72%|███████▏  | 143/200 [01:39<00:28,  1.99it/s]
 72%|███████▏  | 144/200 [01:40<00:28,  1.99it/s]
 72%|███████▎  | 145/200 [01:40<00:27,  1.98it/s]
 73%|███████▎  | 146/200 [01:41<00:27,  1.97it/s]
 74%|███████▎  | 147/200 [01:41<00:26,  1.98it/s]
 74%|███████▍  | 148/200 [01:42<00:25,  2.00it/s]
 74%|███████▍  | 149/200 [01:42<00:21,  2.39it/s]
 75%|███████▌  | 150/200 [01:42<00:17,  2.94it/s]
 76%|███████▌  | 151/200 [01:42<00:13,  3.51it/s]
 76%|███████▌  | 152/200 [01:42<00:11,  4.06it/s]
 76%|███████▋  | 153/200 [01:43<00:10,  4.62it/s]
 77%|███████▋  | 154/200 [01:43<00:08,  5.12it/s]
 78%|███████▊  | 155/200 [01:43<00:08,  5.54it/s]
 78%|███████▊  | 156/200 [01:43<00:07,  5.87it/s]
 78%|███████▊  | 157/200 [01:43<00:06,  6.15it/s]
 79%|███████▉  | 158/200 [01:43<00:06,  6.33it/s]
 80%|███████▉  | 159/200 [01:43<00:06,  6.48it/s]
 80%|████████  | 160/200 [01:44<00:06,  6.60it/s]
 80%|████████  | 161/200 [01:44<00:05,  6.88it/s]
 81%|████████  | 162/200 [01:44<00:05,  7.13it/s]
 82%|████████▏ | 163/200 [01:45<00:18,  1.96it/s]
 82%|████████▏ | 164/200 [01:45<00:15,  2.40it/s]
 82%|████████▎ | 165/200 [01:46<00:12,  2.84it/s]
 83%|████████▎ | 166/200 [01:46<00:09,  3.49it/s]
 84%|████████▎ | 167/200 [01:46<00:07,  4.15it/s]
 84%|████████▍ | 168/200 [01:46<00:06,  4.78it/s]
 84%|████████▍ | 169/200 [01:46<00:05,  5.50it/s]
 85%|████████▌ | 170/200 [01:46<00:04,  6.14it/s]
 86%|████████▌ | 171/200 [01:46<00:04,  6.69it/s]
 86%|████████▌ | 172/200 [01:47<00:03,  7.10it/s]
 86%|████████▋ | 173/200 [01:47<00:03,  7.40it/s]
 87%|████████▋ | 174/200 [01:47<00:03,  7.65it/s]
 88%|████████▊ | 175/200 [01:47<00:03,  7.82it/s]
 88%|████████▊ | 176/200 [01:47<00:03,  7.89it/s]
 88%|████████▊ | 177/200 [01:47<00:02,  8.38it/s]
 89%|████████▉ | 178/200 [01:47<00:02,  8.73it/s]
 90%|████████▉ | 179/200 [01:47<00:02,  9.06it/s]
 90%|█████████ | 180/200 [01:47<00:02,  9.28it/s]
 90%|█████████ | 181/200 [01:48<00:02,  9.44it/s]
 91%|█████████ | 182/200 [01:48<00:01,  9.50it/s]
 92%|█████████▏| 183/200 [01:48<00:01,  9.53it/s]
 92%|█████████▏| 184/200 [01:48<00:01,  8.34it/s]
 93%|█████████▎| 186/200 [01:48<00:01,  9.64it/s]
 94%|█████████▍| 188/200 [01:48<00:01, 10.49it/s]
 95%|█████████▌| 190/200 [01:48<00:00, 10.89it/s]
 96%|█████████▌| 192/200 [01:49<00:00, 11.23it/s]
 97%|█████████▋| 194/200 [01:49<00:00, 12.73it/s]
 98%|█████████▊| 196/200 [01:49<00:00, 13.87it/s]
100%|█████████▉| 199/200 [01:49<00:00, 17.39it/s]
100%|██████████| 200/200 [01:49<00:00,  1.83it/s]
tip: install termplotlib and gnuplot to plot the metrics
============ Serving Benchmark Result ============
Successful requests:                     200       
Failed requests:                         0         
Maximum request concurrency:             200       
Benchmark duration (s):                  109.43    
Total input tokens:                      819200    
Total generated tokens:                  25600     
Request throughput (req/s):              1.83      
Output token throughput (tok/s):         233.94    
Peak output token throughput (tok/s):    702.00    
Peak concurrent requests:                200.00    
Total token throughput (tok/s):          7720.07   
---------------Time to First Token----------------
Mean TTFT (ms):                          48674.35  
Median TTFT (ms):                        47459.96  
P99 TTFT (ms):                           101235.83 
-----Time per Output Token (excl. 1st token)------
Mean TPOT (ms):                          198.95    
Median TPOT (ms):                        222.43    
P99 TPOT (ms):                           226.59    
---------------Inter-token Latency----------------
Mean ITL (ms):                           198.95    
Median ITL (ms):                         246.30    
P99 ITL (ms):                            263.36    
----------------End-to-end Latency----------------
Mean E2EL (ms):                          73940.77  
Median E2EL (ms):                        76107.13  
P99 E2EL (ms):                           109341.28 
==================================================